app/controllers/incidents_controller.rb

    def set_project
      @project = current_user.whole_projects.find(params[:project_id])
---
SELECT `projects`.* FROM `projects` WHERE `projects`.`user_id` = 2 AND `projects`.`id` = 1 LIMIT 1

    def set_incident
      @incident = @project.incidents.find(params[:id])
---
SELECT `incidents`.* FROM `incidents` WHERE `incidents`.`project_id` = 1