app/controllers/invitations_controller.rb

	def create

		params[:invitation][:user_id] = current_user.id
		params[:invitation][:auth_token] = SecureRandom.hex
		@invitation = Invitation.new(params_invitations)
		@base_url = request.host_with_port
		if @invitation.save
---
INSERT INTO `invitations` (`auth_token`, `created_at`, `email`, `role`, `updated_at`, `user_id`) VALUES ('b9665198956bdc66bd9df9ab5ca8e1fc', '2014-06-09 05:17:59', 'faisal.bhatti@devsinc.com', 'client', '2014-06-09 05:17:59', 1)

	def show
		@invitation = Invitation.find params[:id]
---
SELECT `invitations`.* FROM `invitations` WHERE `invitations`.`id` = 1 LIMIT 1

	def destroy
		@invitation = Invitation.find(params[:id])
    	respond_with @invitation.destroy
---
SELECT `invitations`.* FROM `invitations` WHERE `invitations`.`id` = 1 LIMIT 1
DELETE FROM `invitations` WHERE `invitations`.`id` = 1