app/controllers/projects_controller.rb

	def create
		user_client = current_user.client
		params[:project][:creator_id] = current_user.id
		@project = user_client.projects.build(params_project)
		if @project.save
---
INSERT INTO `projects` (`address`, `contact_info`, `created_at`, `creator_id`, `name`, `updated_at`, `user_id`) VALUES ('Chimpchamp', '03324167729', '2014-06-09 11:40:08', 2, 'Test', '2014-06-09 11:40:08', 2)

	def show
		@categories = Category.all.includes(:questions)
---
SELECT `categories`.* FROM `categories`
SELECT `questions`.* FROM `questions` WHERE `questions`.`category_id` IN (1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52, 53, 54, 55, 56, 57, 58, 59, 60, 61, 62, 63, 64)

	def set_project
		@project = current_user.whole_projects.find(params[:id])
---
SELECT `projects`.* FROM `projects` WHERE `projects`.`user_id` = 2 AND `projects`.`id` = 1 LIMIT 1