app/controllers/registrations_controller.rb

  def new

    if params[:email].present? && Invitation.find_by(email: CGI::unescape(params[:email])).present?
---
SELECT `invitations`.* FROM `invitations` WHERE `invitations`.`email` = 'faisal.bhatti@devsinc.com' LIMIT 1

  def create
    @invitation_row = Invitation.find_by_auth_token(allow_token[:auth_token])
    if @invitation_row[:email] != sign_up_params[:email]
      flash[:notice] = "Please Signup from reffered email address"
      redirect_to new_user_registration_path(:auth_token => allow_token[:auth_token])
    else
      params[:user][:role] = @invitation_row.role
      if @invitation_row.role == GlobalConstants::Users::ROLES[:subordinate]
        params[:user][:client_id] = @invitation_row.user_id
      end
      build_resource(sign_up_params)
      if resource.save
        if @invitation_row.role == GlobalConstants::Users::ROLES[:client]
          resource.client_id = resource.id
          resource.save!
        end
        Invitation.update(@invitation_row[:id], :auth_token => nil)
---
SELECT `invitations`.* FROM `invitations` WHERE `invitations`.`auth_token` = 'b9665198956bdc66bd9df9ab5ca8e1fc' LIMIT 1
UPDATE `invitations` SET `auth_token` = NULL, `updated_at` = '2014-06-09 05:19:17' WHERE `invitations`.`id` = 1
UPDATE `users` SET `last_sign_in_at` = '2014-06-09 05:19:17', `current_sign_in_at` = '2014-06-09 05:19:17', `last_sign_in_ip` = '127.0.0.1', `current_sign_in_ip` = '127.0.0.1', `sign_in_count` = 1, `updated_at` = '2014-06-09 05:19:17' WHERE `users`.`id` = 2